{"format": "graph-model", "generatedBy": "2.3.1", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"conv_lst_m2d_input:0": {"name": "conv_lst_m2d_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "16"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/conv_lst_m2d_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/max_pooling3d_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/max_pooling3d_1/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/flatten/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "unknown_13", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5120"}, {"size": "128"}]}}}}}, {"name": "unknown_14", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "unknown_15", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "unknown_16", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "unknown_17", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "unknown_18", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "unknown_19", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "1"}]}}}}}, {"name": "unknown_20", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d_1/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d_1/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d_1/while/maximum_iterations", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "20"}, {"size": "160"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_9", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "40"}, {"size": "160"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_10", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d_1/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/max_pooling3d/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/max_pooling3d/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d_1/Sum/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d_1/zeros", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "20"}, {"size": "40"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "40"}, {"size": "160"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/Sum/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/zeros", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_lst_m2d_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "16"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/transpose", "op": "Transpose", "input": ["conv_lst_m2d_input", "StatefulPartitionedCall/sequential/conv_lst_m2d/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/zeros_like", "op": "ZerosLike", "input": ["conv_lst_m2d_input"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/transpose", "StatefulPartitionedCall/sequential/conv_lst_m2d/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/zeros_like", "StatefulPartitionedCall/sequential/conv_lst_m2d/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/Shape", "StatefulPartitionedCall/sequential/conv_lst_m2d/strided_slice/stack", "StatefulPartitionedCall/sequential/conv_lst_m2d/strided_slice/stack_1", "StatefulPartitionedCall/sequential/conv_lst_m2d/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/Sum", "StatefulPartitionedCall/sequential/conv_lst_m2d/zeros"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential/conv_lst_m2d/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/LoopControlInputs/_38", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential/conv_lst_m2d/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential/conv_lst_m2d/TensorArrayV2_1", "^StatefulPartitionedCall/sequential/conv_lst_m2d/convolution"]}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_33", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/strided_slice", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/LoopControlInputs/_38"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9jb252X2xzdF9tMmQvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_32", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/convolution", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/LoopControlInputs/_38"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9jb252X2xzdF9tMmQvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_30", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/TensorArrayV2_1", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/LoopControlInputs/_38"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9jb252X2xzdF9tMmQvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_31", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/convolution", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/LoopControlInputs/_38"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9jb252X2xzdF9tMmQvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_34", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/LoopControlInputs/_38"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9jb252X2xzdF9tMmQvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_29", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/time", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/LoopControlInputs/_38"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9jb252X2xzdF9tMmQvd2hpbGU="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_27", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/loop_counter", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/LoopControlInputs/_38"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9jb252X2xzdF9tMmQvd2hpbGU="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_28", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/maximum_iterations", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/LoopControlInputs/_38"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9jb252X2xzdF9tMmQvd2hpbGU="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_35", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_1", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/LoopControlInputs/_38"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9jb252X2xzdF9tMmQvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_36", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_2", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/LoopControlInputs/_38"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9jb252X2xzdF9tMmQvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_37", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_3", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/LoopControlInputs/_38"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9jb252X2xzdF9tMmQvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_45", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_33", "StatefulPartitionedCall/sequential/conv_lst_m2d/while/next_iteration/_72"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_44", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_32", "StatefulPartitionedCall/sequential/conv_lst_m2d/while/next_iteration/_71"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_42", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_30", "StatefulPartitionedCall/sequential/conv_lst_m2d/while/next_iteration/_69"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_43", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_31", "StatefulPartitionedCall/sequential/conv_lst_m2d/while/next_iteration/_70"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_46", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_34", "StatefulPartitionedCall/sequential/conv_lst_m2d/while/next_iteration/_73"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_41", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_29", "StatefulPartitionedCall/sequential/conv_lst_m2d/while/next_iteration/_68"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_39", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_27", "StatefulPartitionedCall/sequential/conv_lst_m2d/while/next_iteration/_66"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_40", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_28", "StatefulPartitionedCall/sequential/conv_lst_m2d/while/next_iteration/_67"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/cond/_25/sequential/conv_lst_m2d/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_41", "StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_45", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_46", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_35", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_36", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_37", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_39", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_40", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_42", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_43", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_44"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/LoopCond/_47", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/cond/_25/sequential/conv_lst_m2d/while/Less"]}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/TensorArrayV2_1_switch/_51", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_42", "StatefulPartitionedCall/sequential/conv_lst_m2d/while/LoopCond/_47"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/TensorArrayUnstack/TensorListFromTensor_switch/_55", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_46", "StatefulPartitionedCall/sequential/conv_lst_m2d/while/LoopCond/_47"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/convolution_switch/_52", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_43", "StatefulPartitionedCall/sequential/conv_lst_m2d/while/LoopCond/_47"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/convolution_switch/_53", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_44", "StatefulPartitionedCall/sequential/conv_lst_m2d/while/LoopCond/_47"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/time_switch/_50", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_41", "StatefulPartitionedCall/sequential/conv_lst_m2d/while/LoopCond/_47"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/while/loop_counter_switch/_48", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_39", "StatefulPartitionedCall/sequential/conv_lst_m2d/while/LoopCond/_47"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/while/maximum_iterations_switch/_49", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_40", "StatefulPartitionedCall/sequential/conv_lst_m2d/while/LoopCond/_47"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/strided_slice_switch/_54", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/merge/_45", "StatefulPartitionedCall/sequential/conv_lst_m2d/while/LoopCond/_47"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/exit/_60", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/TensorArrayV2_1_switch/_51"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/exit/_64", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/TensorArrayUnstack/TensorListFromTensor_switch/_55"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/exit/_61", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/convolution_switch/_52"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/exit/_62", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/convolution_switch/_53"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/exit/_59", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/time_switch/_50"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/exit/_57", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/while/loop_counter_switch/_48"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/loop_body_control/_56", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/while/loop_counter_switch/_48:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/exit/_58", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/while/maximum_iterations_switch/_49"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/exit/_63", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/strided_slice_switch/_54"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/exit/_60", "StatefulPartitionedCall/sequential/conv_lst_m2d/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/TensorArrayUnstack/TensorListFromTensor_switch/_55", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/TensorArrayV2_1_switch/_51", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/convolution_switch/_52", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/convolution_switch/_53", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/strided_slice_switch/_54", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/time_switch/_50", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/loop_body_control/_56", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/while/maximum_iterations_switch/_49", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_35", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_36", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_37"]}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential/conv_lst_m2d/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/next_iteration/_72", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/strided_slice_switch/_54:1", "^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/split-folded-3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_35"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/split_1-folded-3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_36"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "40"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/Const_7", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/Const_8", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/clip_by_value_2/Minimum/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/clip_by_value_2/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/split-folded-1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_35"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/split_1-folded-1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_36"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "40"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/Const_5", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/Const_6", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/clip_by_value_1/Minimum/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/clip_by_value_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/split-folded-0", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_35"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/split_1-folded-0", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_36"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "40"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/Const_3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/Const_4", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/clip_by_value/Minimum/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/clip_by_value/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/next_iteration/_73", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/TensorArrayUnstack/TensorListFromTensor_switch/_55:1", "^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/split-folded-2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_35"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input/_141", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/convolution_switch/_52:1", "^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/split_1-folded-2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_36"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "40"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input/_139", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/time_switch/_50:1", "^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/add_8/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/add_9/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/next_iteration/_67", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/while/maximum_iterations_switch/_49:1", "^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/split_2-folded-3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_37"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/split_2-folded-1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_37"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/split_2-folded-0", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_37"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/split_2-folded-2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input_control_node/_136", "^StatefulPartitionedCall/sequential/conv_lst_m2d/while/enter/_37"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/transpose_1", "StatefulPartitionedCall/sequential/batch_normalization/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/convolution_7", "op": "Conv2D", "input": ["Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input/_141", "ConstantFolding/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/split_1-folded-3"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/convolution_5", "op": "Conv2D", "input": ["Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input/_141", "ConstantFolding/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/split_1-folded-1"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/convolution_4", "op": "Conv2D", "input": ["Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input/_141", "ConstantFolding/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/split_1-folded-0"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/convolution_6", "op": "Conv2D", "input": ["Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input/_141", "ConstantFolding/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/split_1-folded-2"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/TensorArrayUnstack/TensorListFromTensor_switch/_55:1", "Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input/_139", "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/add_8", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/input/_139", "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/add_8/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/add_9", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/StatefulPartitionedCall/sequential/conv_lst_m2d/while/loop_counter_switch/_48:1", "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/add_9/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/batch_normalization/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/batch_normalization/batchnorm/mul_1", "StatefulPartitionedCall/sequential/batch_normalization/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/BiasAdd_3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/TensorArrayV2Read/TensorListGetItem", "ConstantFolding/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/split-folded-3", "ConstantFolding/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/split_2-folded-3"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/BiasAdd_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/TensorArrayV2Read/TensorListGetItem", "ConstantFolding/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/split-folded-1", "ConstantFolding/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/split_2-folded-1"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/TensorArrayV2Read/TensorListGetItem", "ConstantFolding/StatefulPartitionedCall/sequential/conv_lst_m2d/while/body/_26/sequential/conv_lst_m2d/while/split-folded-0", 